package hw1;

public class Hw1_4 {
    /*
Задача 4:
В переменной n хранится вещественное число с ненулевой дробной частью.
Создайте программу, которая округляет число n до ближайшего целого и
выводящую результат на экран.
 */
    public static void main(String[] args) {
        double n = 10.23;
        int i = (int) n;

        System.out.println(i);
    }
}
